### I hope you have learned about pandas in a quite good manner , now its time to move on to a test for it. Here you are provided with some questions of which you need to write the code and test your understanding of the concept.

In [4]:
import pandas as pd
import numpy as np

### Q1.

```
import numpy as np
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))
```
**Write code to convert the above mydict variable into dataframe , your code should return a dataframe like below.**

```
a    0
b    1
c    2
d    4
```

In [5]:
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))

In [6]:
mydict

{'a': 0,
 'b': 1,
 'c': 2,
 'e': 3,
 'd': 4,
 'f': 5,
 'g': 6,
 'h': 7,
 'i': 8,
 'j': 9,
 'k': 10,
 'l': 11,
 'm': 12,
 'n': 13,
 'o': 14,
 'p': 15,
 'q': 16,
 'r': 17,
 's': 18,
 't': 19,
 'u': 20,
 'v': 21,
 'w': 22,
 'x': 23,
 'y': 24,
 'z': 25}

In [15]:
ser1=pd.Series(mydict.keys())

In [16]:
ser1

0     a
1     b
2     c
3     e
4     d
5     f
6     g
7     h
8     i
9     j
10    k
11    l
12    m
13    n
14    o
15    p
16    q
17    r
18    s
19    t
20    u
21    v
22    w
23    x
24    y
25    z
dtype: object

In [17]:
pd.DataFrame({"col1":mydict.keys(),"col2":mydict.values()})

   col1  col2
0     a     0
1     b     1
2     c     2
3     e     3
4     d     4
5     f     5
6     g     6
7     h     7
8     i     8
9     j     9
10    k    10
11    l    11
12    m    12
13    n    13
14    o    14
15    p    15
16    q    16
17    r    17
18    s    18
19    t    19
20    u    20
21    v    21
22    w    22
23    x    23
24    y    24
25    z    25

### Q2. Write the code to get frequency count of each character from the result of below command
```
ser = pd.Series(np.take(list('abcdefgh'), np.random.randint(8, size=30)))
```

In [3]:
## your output should look like this.

f    7
c    5
g    4
b    4
h    4
e    3
a    3
dtype: int64

In [18]:
ser = pd.Series(np.take(list('abcdefgh'), np.random.randint(8, size=30)))

In [26]:
ser.unique()

array(['f', 'c', 'a', 'b', 'd', 'e', 'g', 'h'], dtype=object)

### Q3. What parameter to do we need to add in read_csv, which let us read only a bunch of columns from the whole dataset.

In [ ]:
# just write that parameter name here

<p style="color:brown;">For Next 3 question you need to work on fruits sample dataset provided in resources.</p>

In [4]:
# read fruits.csv file

### Q4. Get mean, median, max , min price for each fruit .

In [9]:
# Your output should look like this

   Fruit Name        mean  median  max
0      Banana   98.500000    98.5  112
1       Mango  106.666667   100.0  160
2   PineApple  187.500000   187.5  285
3  Strawberry  200.000000   200.0  200

### Q5. What is the total cost of this basket?

In [10]:
#your output should be this

1092

### Q6. Which fruit has the maximum price per quantity?

In [13]:
# your output should be

'PineApple'

### Q7. Given an array 
```arr = [ 0,1,0,1,0,2,3,6,5,0,0,0,4,1,2,3,5,5,4,4 ]```
<br>
**Write code to  Create one_hot encoded dataframe of this array.**

In [18]:
#your output should be like this and should have 20 records in total

   0  1  2  3  4  5  6
0  1  0  0  0  0  0  0
1  0  1  0  0  0  0  0
2  1  0  0  0  0  0  0
3  0  1  0  0  0  0  0
4  1  0  0  0  0  0  0

### Q8. 
```
dict_ = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score':[np.nan, 40, 80, 98]

```
#### a. Convert this above dict to pandas dataframe

In [22]:
#your output should be like this

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         95.0           NaN         98.0

#### b. Write code to get the number of missing values for each column.

In [23]:
#your output should be like this

First Score     1
Second Score    1
Third Score     1
dtype: int64

#### c. Fill this nan values with mean value of their respective column

In [27]:
#your output should be like this

   First Score  Second Score  Third Score
0        100.0     30.000000    72.666667
1         90.0     45.000000    40.000000
2         95.0     56.000000    80.000000
3         95.0     43.666667    98.000000

### Q9. Add an index column to the table used in Q4.
*HINT : Rest index*

In [28]:
#your output should be like this

   index  Fruit Name  Quantity  Price  price/quantity
0      0      Banana        78    112        1.435897
1      1       Mango        40    160        4.000000
2      2      Banana        20     85        4.250000
3      3   PineApple        15     90        6.000000
4      4  Strawberry       100    200        2.000000
5      5       Mango        25     60        2.400000
6      6       Mango        40    100        2.500000
7      7   PineApple        50    285        5.700000

### Q10. 
**You are provided wih two different csv files ,**
```
sample_sheet_1.csv
sample_sheet_2.csv 
```
<p>
    
**You just need to read both of them , and merge them based on location column.**

In [30]:
#your output should be like this

  Location Population  ...  No. of shops Weekly market day
0      ABB   2.5 lakh  ...           150   Nothing as such
1      ABC   1.5 lakh  ...           120           Tuesday
2      CDD   3.5 lakh  ...           180         Wednesday

[3 rows x 6 columns]